{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "data_format": "channels_first", "dilation_rate": [1, 1], "batch_input_shape": [null, 3, 32, 32], "trainable": true, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "activity_regularizer": null, "filters": 256, "dtype": "float32", "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_first", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "data_format": "channels_first", "dilation_rate": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "relu", "padding": "same", "name": "conv2d_2", "activity_regularizer": null, "filters": 256, "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_first", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "data_format": "channels_first", "dilation_rate": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "relu", "padding": "same", "name": "conv2d_3", "activity_regularizer": null, "filters": 128, "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_3", "padding": "valid", "data_format": "channels_first", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "data_format": "channels_first", "dilation_rate": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "relu", "padding": "same", "name": "conv2d_4", "activity_regularizer": null, "filters": 128, "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_4", "padding": "valid", "data_format": "channels_first", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 2048, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "activation": "relu", "use_bias": true, "name": "dense_1", "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.25}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 1024, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "activation": "relu", "use_bias": true, "name": "dense_2", "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 10, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "activation": "softmax", "use_bias": true, "name": "dense_3", "activity_regularizer": null, "kernel_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.0.4"}