{"backend": "tensorflow", "config": [{"config": {"bias_constraint": null, "data_format": "channels_first", "name": "conv2d_1", "kernel_regularizer": null, "padding": "valid", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null, "filters": 30, "dilation_rate": [1, 1], "kernel_size": [5, 5], "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "batch_input_shape": [null, 1, 28, 28], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_first", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "data_format": "channels_first", "name": "conv2d_2", "kernel_regularizer": null, "padding": "valid", "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "filters": 15, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activation": "relu", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_first", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "name": "dense_1", "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 128}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "name": "dense_2", "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 50}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "name": "dense_3", "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 10}, "class_name": "Dense"}], "keras_version": "2.0.4", "class_name": "Sequential"}